D = {
	'Понасенков': ['Актер', 'Историк', 'режиссер', 'Тенор', 'Маэстро'],
	'Андрей': ['Студент', 'Физик'],
	'Влад': ['Студент', 'Физик'],
	'Матвей': ['Студент', 'Медик']
	}

for k,v in D.items():
	print('Этос участника '+ k +':')
	n = 0
	for v1 in v:
		n += 1
		print('\t' + str(n) + '. ' + v1.title())
	print('\n')
	
D1 = {
	  'Понасенков': {
					 'возраст': '40',
					 'профессия': 'историк',
					 'пол': 'мужской'
				    },
	  'влад': {
	           'возраст': '21',
	           'профессия': 'студент',
	           'пол': 'мужской'
			  },
	  'андрей': {
				 'возраст': '22',
	             'профессия': 'студент',
	             'пол': 'мужской'
				},
      'матвей': {
				 'возраст': '19',
	             'профессия': 'студент',
	             'пол': 'мужской'
				}
	 }

#Вывод словаря
print('\n')

K = {'возраст': '22',
					 'профессия': 'истор',
					 'пол': 'мужск'}
D1['матвей'] = K
for k in D1.keys():
	print(k.title())
	for y,x in D1[k].items():
		print(y.title()+': '+x.title())
	print('\n')
